myrottenpotatoes/app/controllers/movies_controller.rb

    def index
        # filter ratings and set checkbox
        filter_ratings
        # order movies by params[:sort_by]
        @movies = Movie.order(params[:sort_by]).where(:rating => filter_ratings)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IS NULL LIMIT ?  [["LIMIT", 1]]

    def filter_ratings
        @checked = {'G'=>true,'PG'=>true,'PG-13'=>true,'R'=>true,'NC-17'=>true}
        @all_ratings = Movie.all_ratings
        ratings = []
        if params[:ratings].present?
            @all_ratings.each do |r|
                @checked[r] = false
                params[:ratings].each do |key,value|
                    ratings.push key
---
SELECT "movies".* FROM "movies"
UPDATE "movies" SET "title" = ?, "rating" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Thiago: O Homem"], ["rating", "PG-13"], ["updated_at", "2021-08-17 14:15:54.990848"], ["id", 16]]
INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ola"], ["rating", "G"], ["release_date", "2021-08-22 00:00:00"], ["created_at", "2021-08-22 12:00:18.146395"], ["updated_at", "2021-08-22 12:00:18.146395"]]

    def update
        @movie = Movie.find params[:id]
        @movie.update(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
UPDATE "movies" SET "title" = ?, "rating" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Django Unchained"], ["rating", "R"], ["release_date", "2026-08-23 00:00:00"], ["updated_at", "2021-08-25 17:52:26.543782"], ["id", 22]]